In [1]:
import pandas as pd

### Задание 1

In [39]:
df =  pd.read_csv('ratings.csv')
df_names = pd.read_csv('movies.csv')

In [46]:
sorted_df = df[df.rating == 5.0].groupby('movieId').count().sort_values(by = 'rating', ascending = False)

In [57]:
full_df_2 = pd.merge(sorted_df, df_names, on = 'movieId')[['movieId', 'title', 'rating']]
full_df_2.head(1)

   movieId                             title  rating
0      318  Shawshank Redemption, The (1994)     153

### Задание 2

In [31]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [7]:
#power.country.unique()

In [58]:
pribaltika = power[(power.country.isin(['Latvia', 'Estonia', 'Lithuania'])) & ((power.category == 4) | (power.category == 12) | (power.category == 21)) & ((power.year >= 2005) & ( power.year <= 2010)) & (power.quantity >= 0.0)]
pribaltika

          country  year  quantity  category
10617     Estonia  2008       1.0         4
10618     Estonia  2007       0.0         4
10619     Estonia  2006       0.0         4
10620     Estonia  2005       1.0         4
11156   Lithuania  2008       1.0         4
...           ...   ...       ...       ...
253982  Lithuania  2009      98.0        21
253983  Lithuania  2008      54.0        21
253984  Lithuania  2007      47.0        21
253985  Lithuania  2006      31.0        21
253986  Lithuania  2005       1.0        21

[408 rows x 4 columns]

In [35]:
pribaltika.groupby('country').quantity.count().sort_values(ascending = False)

country
Lithuania    217
Estonia       99
Latvia        92
Name: quantity, dtype: int64

### Задание 3

In [17]:
page = 'https://www.climatestotravel.com/climate/netherlands/amsterdam'
weather_df = pd.read_html(page, attrs = {'class': "cities"}, encoding = 'utf-8')[0]

In [18]:
weather_df

      Month  Jan  Feb  Mar  Apr  May  Jun  Jul  Aug  Sep  Oct  Nov  Dec
0  Min (°C)    1    0    3    5    8   11   12   11   11    8    4    2
1  Max (°C)    6    6   10   14   17   20   22   22   19   14   10    6
2  Min (°F)   34   32   37   41   46   52   54   52   52   46   39   36
3  Max (°F)   43   43   50   57   63   68   72   72   66   57   50   43